package part4.Ex2_25randomInt;
//: Напишите программу, которая выводит число от 1 до 100

public class Ex2 {
    public static void main(String[] args) {
        System.out.println( (int) ( Math.random()*100 ) );
    }
}